<a href="https://colab.research.google.com/github/bagcakaya/DAwPy_Lesson_6/blob/main/DAwPy_Lesson_6.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

# ***Recap fr Apply-Transform-Map-Filter***

---

In [2]:
df6 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C','A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99,40,20,15],
                   'var2': [100,253,333,262,111,969, 232,343,123]})
df6

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    40   232
7      B    20   343
8      C    15   123

In [9]:
df6[["var1"]].transform(lambda x : ( x - df6["var1"].min() )/
                                       (df6["var1"].max()-df6["var1"].min())
                       )

       var1
0  0.000000
1  0.146067
2  0.258427
3  0.134831
4  0.011236
5  1.000000
6  0.337079
7  0.112360
8  0.056180

In [10]:
df6[["var1","var2"]].apply(lambda x : ( x - df6["var1"].min() )/
                                       (df6["var1"].max()-df6["var1"].min())  )

       var1       var2
0  0.000000   1.011236
1  0.146067   2.730337
2  0.258427   3.629213
3  0.134831   2.831461
4  0.011236   1.134831
5  1.000000  10.775281
6  0.337079   2.494382
7  0.112360   3.741573
8  0.056180   1.269663

In [11]:
df6[["var1","var2"]].transform(lambda x : (x-x.min())/(x.max()-x.min()))

       var1      var2
0  0.000000  0.000000
1  0.146067  0.176064
2  0.258427  0.268124
3  0.134831  0.186421
4  0.011236  0.012658
5  1.000000  1.000000
6  0.337079  0.151899
7  0.112360  0.279632
8  0.056180  0.026467

In [12]:
df6.groupby("groups")[["var1", "var2"]].transform(np.mean)

   var1        var2
0  24.0  198.000000
1  18.0  235.666667
2  49.0  475.000000
3  24.0  198.000000
4  18.0  235.666667
5  49.0  475.000000
6  24.0  198.000000
7  18.0  235.666667
8  49.0  475.000000

In [28]:
df6["var1"].transform([np.sqrt, np.exp, lambda x: x**2])

       sqrt           exp  <lambda>
0  3.162278  2.202647e+04       100
1  4.795832  9.744803e+09       529
2  5.744563  2.146436e+14      1089
3  4.690416  3.584913e+09       484
4  3.316625  5.987414e+04       121
5  9.949874  9.889030e+42      9801
6  6.324555  2.353853e+17      1600
7  4.472136  4.851652e+08       400
8  3.872983  3.269017e+06       225

In [31]:
df6.groupby("groups").filter(lambda x : x["var2"].mean() > 200)

  groups  var1  var2
1      B    23   253
2      C    33   333
4      B    11   111
5      C    99   969
7      B    20   343
8      C    15   123

In [32]:
df6[df6["var2"] > 200]

  groups  var1  var2
1      B    23   253
2      C    33   333
3      A    22   262
5      C    99   969
6      A    40   232
7      B    20   343

# ***`map and replace`***

In [37]:
df6["groups"].map({"A" : "adam", "B" : "Bruce"})

0     adam
1    Bruce
2      NaN
3     adam
4    Bruce
5      NaN
6     adam
7    Bruce
8      NaN
Name: groups, dtype: object

In [38]:
df6[["groups"]].replace({"A" : 0, "B" : 1})

  groups
0      0
1      1
2      C
3      0
4      1
5      C
6      0
7      1
8      C

# ***`pivot table`***

In [40]:
import seaborn as sns

In [41]:
titanic = sns.load_dataset('titanic')
titanic

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0           0       3    male  22.0  ...   NaN  Southampton     no  False
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
2           1       3  female  26.0  ...   NaN  Southampton    yes   True
3           1       1  female  35.0  ...     C  Southampton    yes  False
4           0       3    male  35.0  ...   NaN  Southampton     no   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[891 rows x 15 columns]

In [42]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [43]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [44]:
type(titanic)

pandas.core.frame.DataFrame

In [48]:
titanic.groupby(["sex", "pclass"])[["survived"]].mean()

               survived
sex    pclass
female 1       0.968085
       2       0.921053
       3       0.500000
male   1       0.368852
       2       0.157407
       3       0.135447

In [53]:
titanic.pivot_table(values="survived", index ="sex", columns="pclass")

pclass         1         2         3
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [54]:
titanic.groupby(["sex", "pclass"])[["survived"]].mean().unstack()

        survived
pclass         1         2         3
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [56]:
titanic.groupby(["who", "sex", "pclass"])[["survived"]].mean()

                     survived
who   sex    pclass
child female 1       0.666667
             2       1.000000
             3       0.533333
      male   1       1.000000
             2       1.000000
             3       0.321429
man   male   1       0.352941
             2       0.080808
             3       0.119122
woman female 1       0.978022
             2       0.909091
             3       0.491228

In [61]:
titanic.groupby(["who", "sex", "pclass"])[["survived"]].mean().unstack()

              survived
pclass               1         2         3
who   sex
child female  0.666667  1.000000  0.533333
      male    1.000000  1.000000  0.321429
man   male    0.352941  0.080808  0.119122
woman female  0.978022  0.909091  0.491228

In [60]:
titanic.groupby(["who", "sex", "pclass"])[["survived"]].mean().unstack().unstack()

        survived
pclass         1                   2                   3
sex       female      male    female      male    female      male
who
child   0.666667  1.000000  1.000000  1.000000  0.533333  0.321429
man          NaN  0.352941       NaN  0.080808       NaN  0.119122
woman   0.978022       NaN  0.909091       NaN  0.491228       NaN

In [64]:
titanic.pivot_table(values="survived", index =["sex", "who"], columns="pclass", aggfunc="count")

pclass          1   2    3
sex    who
female child    3  10   30
       woman   91  66  114
male   child    3   9   28
       man    119  99  319

In [69]:
titanic.groupby(["who", "sex", "pclass"])[["survived","fare"]].mean().unstack(1)

              survived                  fare
sex             female      male      female        male
who   pclass
child 1       0.666667  1.000000  160.962500  117.802767
      2       1.000000  1.000000   29.240000   27.306022
      3       0.533333  0.321429   19.023753   27.716371
man   1            NaN  0.352941         NaN   65.951086
      2            NaN  0.080808         NaN   19.054124
      3            NaN  0.119122         NaN   11.340213
woman 1       0.978022       NaN  104.317995         NaN
      2       0.909091       NaN   20.868624         NaN
      3       0.491228       NaN   15.354351         NaN

In [70]:
titanic.groupby(["who", "sex", "pclass"])[["survived","fare"]].mean()

                     survived        fare
who   sex    pclass
child female 1       0.666667  160.962500
             2       1.000000   29.240000
             3       0.533333   19.023753
      male   1       1.000000  117.802767
             2       1.000000   27.306022
             3       0.321429   27.716371
man   male   1       0.352941   65.951086
             2       0.080808   19.054124
             3       0.119122   11.340213
woman female 1       0.978022  104.317995
             2       0.909091   20.868624
             3       0.491228   15.354351

In [71]:
df = pd.DataFrame({'A':[1, 2, np.nan],
                  'B':[5, np.nan, np.nan],
                  'C':[1, 2, 3]})

In [72]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [74]:
df.isnull() #TÃ¼m dataseti True/False'a dÃ¶nÃ¼ÅŸtÃ¼rÃ¼r.

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [75]:
df.isna() #TÃ¼m dataseti True/False'a dÃ¶nÃ¼ÅŸtÃ¼rÃ¼r.

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [76]:
df.notnull() #TÃ¼m dataseti Nan olmayanlar True diÄŸerleri False'a dÃ¶nÃ¼ÅŸtÃ¼rÃ¼r.

       A      B     C
0   True   True  True
1   True  False  True
2  False  False  True

In [79]:
df.dropna(axis=1) #VarsayÄ±lan olarak indexlerde silme iÅŸlemi yapar.

   C
0  1
1  2
2  3

In [80]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [ ]:
df.dropna()

In [87]:
df2 = df.append([np.nan]).reset_index()
df2

   index    A    B    C   0
0      0  1.0  5.0  1.0 NaN
1      1  2.0  NaN  2.0 NaN
2      2  NaN  NaN  3.0 NaN
3      0  NaN  NaN  NaN NaN

In [91]:
df2.dropna(how="all") #tamamÄ± Nan iÃ§eren satÄ±rÄ± tamamen siler.

   index    A    B    C   0
0      0  1.0  5.0  1.0 NaN
1      1  2.0  NaN  2.0 NaN
2      2  NaN  NaN  3.0 NaN
3      0  NaN  NaN  NaN NaN

In [107]:
df2.dropna(thresh=1, axis = 0) # 2 tane Nan olmayan deÄŸerleri gÃ¶sterir

   index    A    B    C   0
0      0  1.0  5.0  1.0 NaN
1      1  2.0  NaN  2.0 NaN
2      2  NaN  NaN  3.0 NaN
3      0  NaN  NaN  NaN NaN

In [109]:
df2.notnull() #KaÃ§ tane Nan olmayan deÄŸeri True/False olarak verir

   index      A      B      C      0
0   True   True   True   True  False
1   True   True  False   True  False
2   True  False  False   True  False
3   True  False  False  False  False

In [112]:
df2.fillna(-1) #Nan deÄŸerleri belirlenen ÅŸeye gÃ¶re doldurur.

   index    A    B    C    0
0      0  1.0  5.0  1.0 -1.0
1      1  2.0 -1.0  2.0 -1.0
2      2 -1.0 -1.0  3.0 -1.0
3      0 -1.0 -1.0 -1.0 -1.0